// dllmain.cpp : Defines the entry point for the DLL application.

#pragma once
///////////////////////////////////////////
//////////////// Defines   //////////////
///////////////////////////////////////////

#define ui unsigned long long
#define cc const char*
#define u64 ui
#pragma once
#define _int64 long long
#define n2hex(x) (n2hexstr(x).c_str())
#define InRange(x, a, b) (x >= a && x <= b)
#define getBit(x) (InRange((x & (~0x20)), 'A', 'F') ? ((x & (~0x20)) - 'A' + 0xA): (InRange(x, '0', '9') ? x - '0': 0))
#define getByte(x) (getBit(x[0]) << 4 | getBit(x[1]))
#define VT_METHOD(region, index) (*(ui*)(*(ui*)region + index * 8))
#define Colors(r,g,b) (\(u32)r |\(u32)(g << 8) | \(u32)(b << 16) | \(u32)(255 << 24)\)

#define SCREEN_WIDTH  1600
#define SCREEN_HEIGHT 900


///////////////////////////////////////////
//////////////// Includes    //////////////
///////////////////////////////////////////


#include "logger.h"

#include <ctime>
#include <string>
#include <Psapi.h>
#include <iostream>
#include "vector.h"
#include <algorithm>
#include <vector>
#include <array>
#include <ctime>
#include <chrono>
#include <thread>
#include <queue>
#include <set>
#include "prototypes.h"

#include <stdint.h>
 ////////////////////////////////////////////////////
///////////// Globals //////////////////////////////
////////////////////////////////////////////////////




u64 GetStatePointer;

int temp;
int LocalPlayerIndex = 0;
int LocalPlayerTeam = 0;
int heroescount = 0;
std::set<CBaseEntity*>Hero;
CBaseEntity* Heroes[10] = { 0,0,0,0,0,0,0,0,0,0 };

std::set<CBaseEntity*> Entities; //// Heroes, Illusions , etc.
std::set<CBaseEntity*> AllEntities; //// All new created entities
std::set<CDOTA_Ability*> Abilities;

DrawManaData ManaDraw[5];

Enemy Enemies[5];

int state = 0;
int heroesInArray = 0;
bool Init = 0;
int count = 0;
bool hooked = 0;
float tempfloat = 0;

Matrix WorldMatrix;
u64 RenderSystemPtr;
u64 OrigFunc;
CGameEntitySystem* EntSystem;
u64 Panorama2;
Panorama* panoramaptr;
u64 RenderSystem;
u64 RenderSystemobj;

bool InGame = 0;
bool VMTBegin = 0;
bool gotheroes = 0;
int Red = 0xFF0000FF; // RGBA  ABGR
int Green = 0xFF00FF00;
ui tempOnAddEntity, tempRunFrame;
int highestindex = 0;

bool gotent = 0;
CBaseEntity* localent = nullptr;
u64 Schema;
u64 m_iHealth, m_iMaxHealth, m_flMana, m_flMaxMana, m_iCurrentLevel, m_hAbilities, m_lifeState, m_hReplicatingOtherHeroModel, m_iTeamNum, m_hOwnerEntity, m_clrRender,
m_iGlowType, m_glowColorOverride, a_m_iLevel, a_m_iManaCost, a_m_flCooldownLength, a_m_fCooldown, a_m_bHidden, m_Glow, m_iHealthBarOffset,
m_pGameSceneNode, m_vecAbsOrigin, m_fGameTime, m_nGameState, m_iTaggedAsVisibleByTeam, m_bDormant;



bool one = 0;
bool once = 0;
int counter_dev = 0;
int counter = 0;
Particle* particle1;
Particle* particle2;
Particle* particle0;
FVector mypos;
FVector2 myposscreen;
bool once2 = 0;
bool lplayer = 0;




// Globals:script

bool zeus;
bool axe;
bool pudge;
bool heroscript = 0;
int zuus_counter = 0;
int pudge_counter = 0;
int zuus_blowcounter = 1;
float pudge_hookrange = 1300;
float axe_ultirange = 150;
CDOTA_Ability* Ultimate = nullptr;




////////////////////////////////////////////////////
///////////// Classes //////////////////////
////////////////////////////////////////////////////



class CGameEntitySystem;
class CEntityInstance;
class CBaseEntity;
class C_DOTAPlayer;
class CDOTA_Ability;
class CEntityIdentities;
class EntityIdentityList;
class CEntitySystem;
class MemberInfo;
class ClassDescription;








class CEntityInstance
{
public:
    CBaseEntity* entity;//00
    void* baseinfo;//8
    int64_t handle;//1
    int64_t unk1;//1
    const char* internalName;//18
    const char* entityName;//20
    void* unk2;
    void* unk3;
    void* unk4;
    void* unk5;
    CEntityInstance* PrevEnt; // 0x50
    CEntityInstance* NextEnt; // 0x58
    void* unkptr;
    void* unkptr2;
    void* unkptr3;

    cc GetName()
    {
        cc name;
        if (this->internalName)
        {
            name = this->internalName;
            return name;

        }
        else
        {
            if (this->entityName)
            {
                name = this->entityName;
                return name;
            }
            else
            {
                name = "Unknown";
                return name;
            }
        }
    }
    cc GetBaseClass()
    {
        if (!***(cc***)((ui)this + 0x8))
        {
            return "unknown";
        }
        return ***(cc***)((ui)this + 0x8);
    }
    bool IsHero()
    {
        if (!strcmp("C_DOTA_BaseNPC_Hero", GetBaseClass())) // 0 means identical
        {
            return true;
        }
        else
        {
            return false;
        }
    }
};





#define EntityHandle unsigned int
#define MAX_ENTITIES_IN_LIST 512
#define MAX_ENTITY_LISTS 64
#define MAX_TOTAL_ENTITIES MAX_ENTITIES_IN_LIST * MAX_ENTITY_LISTS





class CEntityIdentities
{
public:
    CEntityInstance m_pIdentities[MAX_ENTITIES_IN_LIST];
};


class EntityIdentityList
{
public:
    CEntityIdentities* m_pIdentityList;
};


#define ClearEntityDatabaseMode_t char
#define CEntityHandle unsigned int
#define EntitySpawnInfo_t char

class CEntitySystem {
public:
    virtual void n_0();
    virtual void BuildResourceManifest(void); // 01
    virtual void n_2();
    virtual void n_3();
    virtual void n_4();
    virtual void n_5();
    virtual void n_6();
    virtual void AddRefKeyValues(void const*); // 7
    virtual void ReleaseKeyValues(void const*); // 8
    virtual void n_9();
    virtual void n_10();
    virtual void ClearEntityDatabase(void); // 11
    virtual CEntityInstance* FindEntityProcedural(const char *...);
    virtual CEntityInstance* OnEntityParentChanged(CEntityInstance*, CEntityInstance*); //13
    virtual CEntityInstance* OnAddEntity(CEntityInstance*, CEntityHandle); // 14
    virtual CEntityInstance* OnRemoveEntity(CEntityInstance*, CEntityHandle); // 15
    virtual void n_16();
    virtual void SortEntities(int, EntitySpawnInfo_t*, int*, int*); // 17
    virtual void n_18();
    virtual void n_19();
    virtual void n_20();
    virtual void n_21();
};

class CGameEntitySystem : public CEntitySystem
{
public:

    void* unk;
    //void* unk2; 
    //void* unk3;, remove because of vtable

    CEntityIdentities* m_pEntityList[MAX_ENTITY_LISTS];

    CBaseEntity* GetBaseEntity(int index)
    {
        if (index <= -1 || index >= MAX_TOTAL_ENTITIES)
            return nullptr;

        //std::cout << "m_pEntityList: " << std::hex << (uintptr_t)m_pEntityList << std::endl;

        int listToUse = (index / MAX_ENTITIES_IN_LIST);
        if (!m_pEntityList[listToUse]) {
            printf("Tried to Use an EntityList does that not exist yet! List #%d\n", listToUse);
            return nullptr;
        }
        if (m_pEntityList[listToUse]->m_pIdentities[index % MAX_ENTITIES_IN_LIST].entity) {
            return m_pEntityList[listToUse]->m_pIdentities[index % MAX_ENTITIES_IN_LIST].entity;
        }
        else {
            return nullptr;
        }
    }
    int GetHighestEntityIndex()
    {

        return *(int*)((uintptr_t)this + 0x2090);
    }
};
CGameEntitySystem* entsystem;


class CHandle;
class LocalHero
{
public:
    CBaseEntity* pEnt;
    C_DOTAPlayer* pPlayer;
    int health = 0;
    float mana = 0;
    int Abilities[32];
    bool SeenByEnemy = 0;
    bool IsOnSentry = 0;
    bool GetAbilities()
    {
        for (int i = 0; i < 32; i++)
        {
            Abilities[i] = *(BYTE*)((ui)pEnt + m_hAbilities + i * 4);
        }
        return true;
    }
}localhero;

class CDOTA_Ability
{
public:

    ui* vtable;//00
    char shit[2]; //08
    CEntityInstance* instance; //0x0010

    int GetIndex()
    {
        return this->instance->handle & 0x7FFF;
        //& 0x7fff
    }
    void FindAbilities()
    {
        IsCooldownReady = *(_IsCooldownReady*)(*(ui*)this + 0x728);
        IsInAbilityPhase = *(_IsInAbilityPhase*)(*(ui*)this + 0x838);
        GetCastRange = *(_GetCastRange*)(*(ui*)this + 0x7A0);
    }
    bool CanBeUsed()
    {


        bool iscooldownready = IsCooldownReady(this);
        bool AbilityPhase = IsInAbilityPhase(this);



        if (iscooldownready && !AbilityPhase)
        {
            return true;
        }
        return false;
    }
    int GetAbilityDamage()
    {

        if (!oGetAbilityDamage)
        {
            oGetAbilityDamage = (_oGetAbilityDamage)VT_METHOD(this, 279);

        }
        int it = oGetAbilityDamage(this);
        return it;
    }
    int GetLevel()
    {
        return *(int*)((ui)this + 0x5A8);
    }



};



int GetLocalPlayer()
{
    int tempint = 0;
    GetLocalPlayerIndex((ui*)CEngineClient, &tempint, 0);
    return tempint + 1;
}


class CBaseEntity
{

public:
    ui* vtable;//00
    char shit[2]; //08
    CEntityInstance* instance; //0x0010




    struct Info
    {
        bool IsSeen = 0;
    }unitinfo;
    cc GetBaseClass()
    {


        if (***(cc***)(*(ui*)((ui)this + 0x10) + 0x8))
        {
            return ***(cc***)(*(ui*)((ui)this + 0x10) + 0x8);

        }

        else
        {
            return "Unknown";
        }
    }
    float GetMoveSpeed()
    {
        if (!GetIdealMoveSpeed)
        {
            GetIdealMoveSpeed = *(_GetIdealMoveSpeed*)(*(ui*)this + 0x6F8);
        }
        return GetIdealMoveSpeed(this);
    }
    Vector GetForward()
    {
        Vector result = { 0,0,0 };
        Vector* empty = &result;


        if (!oGetVector)
        {
            oGetVector = *(_GetVector*)(*(ui*)this + 0x1F0);
        }
        oGetVector(this, &result, nullptr, nullptr);
        return result;
    }
    int GetHealthBarOffset()
    {
        return *(int*)((ui)this + m_iHealthBarOffset);
    }

    bool IsIllusion()
    {
        if (*(ui*)((ui)this + m_hReplicatingOtherHeroModel) != 0xFFFFFFFF)
        {
            return true;
        }
        return false;
    }
    bool IsHero()
    {
        if (!strcmp("C_DOTA_BaseNPC_Hero", this->GetBaseClass())) // 0 means identical
        {
            return true;
        }
        else
        {
            return false;
        }
    }
    bool IsAbility()
    {
        if (!strcmp("C_DOTABaseAbility", this->GetBaseClass())) // 0 means identical
        {
            return true;
        }
        else
        {
            return false;
        }
    }
    bool IsSeenByEnemy()
    {
        if (*(int*)((ui)this + m_iTaggedAsVisibleByTeam) == 14)
        {
            return true;
        }
        return false;
    }
    bool IsSeenGemSentry()
    {
        if (HasModifier(this, "modifier_truesight"))
        {
            return true;
        }
        return false;
    }
    bool IsChargedByBreaker()
    {
        if (HasModifier(this, "modifier_spirit_breaker_charge_of_darkness_vision"))
        {
            return true;
        }
        return false;
    }
    void SetColor(BYTE r, BYTE g, BYTE b, BYTE a)
    {
        if (*(BYTE*)((ui)this + m_clrRender + 0) == r && *(BYTE*)((ui)this + m_clrRender + 1) == g && *(BYTE*)((ui)this + m_clrRender + 2) == b && *(BYTE*)((ui)this + m_clrRender + 3) == a)
        {
            return;
        }
        *(BYTE*)((ui)this + m_clrRender + 0) = r;
        *(BYTE*)((ui)this + m_clrRender + 1) = g;
        *(BYTE*)((ui)this + m_clrRender + 2) = b;
        *(BYTE*)((ui)this + m_clrRender + 3) = a;
        OnColorChanged((ui*)this);
    }
    cc GetName()
    {
        cc name;
        if (*(cc*)(*(ui*)((ui)this + 0x10) + 0x18))
        {
            name = *(cc*)(*(ui*)((ui)this + 0x10) + 0x18);
            return name;

        }
        else
        {
            if (*(cc*)(*(ui*)((ui)this + 0x10) + 0x20))
            {
                name = *(cc*)(*(ui*)((ui)this + 0x10) + 0x20);
                return name;
            }
            else
            {
                name = "Unknown";
                return name;
            }
        }
    }
    float GetMaxMana()
    {
        return *(float*)((ui)this + m_flMaxMana);
    }
    int GetManaPerc()
    {
        return (int)((this->GetMana() / this->GetMaxMana()) * 100);
    }
    Vector GetAbsOrigin()
    {

        ui gamescenenode = *(ui*)((ui)this + m_pGameSceneNode);
        return *(Vector*)(gamescenenode + m_vecAbsOrigin);
    }

    bool IsDormant() 
    {
        return *(bool*)((ui)this + m_bDormant);
    }
    

    bool WorldToScreen(Vector& abs, FVector& screen, int& x, int& y)
    {
        FVector2 result;
        x = 0;
        y = 0;

        abs = this->GetAbsOrigin();
        int healthbaroffset = this->GetHealthBarOffset();
        abs.z += healthbaroffset;

        bool bResult = W2S(abs, &x, &y, nullptr);


        if (bResult)
        {

            Vector4 myvec = { 0.0,0.0,0.0,0.0 };
            float dif;


            myvec.w = ((abs.x * WorldMatrix.m[12]) + (abs.y * WorldMatrix.m[13])) + ((abs.z * WorldMatrix.m[14]) + WorldMatrix.m[15]);
            myvec.y = ((abs.x * WorldMatrix.m[4]) + (abs.y * WorldMatrix.m[5])) + ((abs.z * WorldMatrix.m[6]) + WorldMatrix.m[7]);
            if (myvec.w >= 0.001)
            {
                dif = 1.0f / myvec.w;
            }
            else
            {
                dif = 100000.0f;

            }
            myvec.x = (((abs.y * WorldMatrix.m[1]) + (abs.x * WorldMatrix.m[0])) + ((abs.z * WorldMatrix.m[2]) + WorldMatrix.m[3]));
            myvec.z = (((abs.x * WorldMatrix.m[8]) + (abs.y * WorldMatrix.m[9]) + (abs.z * WorldMatrix.m[10]) + WorldMatrix.m[11]));
            screen.y = myvec.y / myvec.w;
            screen.x = myvec.x / myvec.w;
            screen.z = myvec.z / myvec.w;
        }


        if (x < 0 || y < 0)
        {
            return 0;
        }

        return bResult;

    }

    int GetHealth()
    {
        return *(int*)((ui)this + m_iHealth);
    }
    float GetMana() {
        return *(float*)((ui)this + m_flMana);
    }
    int GetTeam()
    {
        if ((ui)this <= 0)
        {
            return 0;
        }
        return *(unsigned short*)((ui)this + m_iTeamNum);
    }
    int GetUnitIndex()
    {
        return this->instance->handle & 0x7FFF;
        //& 0x7fff
    }
    int GetOwnerIndex()
    {
        if ((ui)this)
        {
            return *(int*)((ui)this + m_hOwnerEntity) & 0x7FFF;
        }
        return 0;
    }
    bool IsAlive()
    {
        if (*(BYTE*)((ui)this + m_lifeState) == 0)
        {
            return true;
        }
        return false;
    }
    bool IsEnemy()
    {

        if (!LocalPlayerTeam)
        {
            int LocalPlayerIndex = GetLocalPlayer();
            if (!localhero.pEnt)
            {
                for (int i = 0; i < entsystem->GetHighestEntityIndex(); i++)
                {
                    auto ent = entsystem->GetBaseEntity(i);
                    auto ownerindex = ent->GetOwnerIndex();
                    if (ownerindex == LocalPlayerIndex)
                    {
                        localhero.pEnt = ent;
                        localhero.pPlayer = localhero.pEnt->GetPlayer();
                        LocalPlayerTeam = localhero.pEnt->GetTeam();

                        break;
                    }
                }
            }

        }


        if (this->GetTeam() != LocalPlayerTeam)
        {
            return true;
        }
        return false;
    }
    bool IsLocalEntity()
    {
        int Index = this->GetOwnerIndex();
        if (!LocalPlayerIndex)
        {
            LocalPlayerIndex = GetLocalPlayer();
        }
        if (Index == LocalPlayerIndex)
        {
            return true;
        }
        return false;
    }
    C_DOTAPlayer* GetPlayer()
    {
        for (int i = 0; i < 12; i++)
        {
            if (!LocalPlayerIndex)
            {
                LocalPlayerIndex = GetLocalPlayer();
            }
            auto OwnerIndex = this->GetOwnerIndex();
            auto ent = entsystem->GetBaseEntity(i);
            auto Index = ent->GetUnitIndex();
            if (Index == OwnerIndex)
            {
                return *(C_DOTAPlayer**)ent;
            }
        }
    }
    //DotaUnitOrder_t order, int entHandle, Vector movePosition, int abilityIndex,PlayerOrderIssuer_t orderIssuer, CDotaBaseNPC* entity, OrderQueueBehavior_t queueBehavior, bool showEffect
    void SpellPointTarget(int AbilityIndex, CBaseEntity* target)
    {
        Vector position = target->GetAbsOrigin();
        float movespeed = target->GetMoveSpeed();
        Vector forward = target->GetForward();
        position = position + (forward * movespeed);
        if (localhero.pPlayer == nullptr) { localhero.pPlayer = localhero.pEnt->GetPlayer(); }
        PrepareUnitOrders(localhero.pPlayer, DotaUnitOrder_t::DOTA_UNIT_ORDER_CAST_POSITION, 0, position, AbilityIndex, PlayerOrderIssuer_t::DOTA_ORDER_ISSUER_HERO_ONLY, this, 0, OrderQueueBehavior_t::DOTA_ORDER_QUEUE_DEFAULT, 0);
    }
    void SpellNoTarget(int AbilityIndex)
    {
        Vector empty = { 0,0,0 };
        PrepareUnitOrders(localhero.pPlayer, DotaUnitOrder_t::DOTA_UNIT_ORDER_CAST_NO_TARGET, NULL, empty, AbilityIndex, PlayerOrderIssuer_t::DOTA_ORDER_ISSUER_HERO_ONLY, this, 0, OrderQueueBehavior_t::DOTA_ORDER_QUEUE_DEFAULT, 0);
    }
    void SpellTarget(int AbilityIndex, CBaseEntity* target)
    {
        Vector empty = { 0,0,0 };
        PrepareUnitOrders(localhero.pPlayer, DotaUnitOrder_t::DOTA_UNIT_ORDER_CAST_TARGET, target->GetUnitIndex(), empty, AbilityIndex, PlayerOrderIssuer_t::DOTA_ORDER_ISSUER_HERO_ONLY, this, 0, OrderQueueBehavior_t::DOTA_ORDER_QUEUE_DEFAULT, 0);
    }
};//(C_DOTAPlayer* player, DotaUnitOrder_t order, int entHandle, Vector movePosition, int abilityIndex, PlayerOrderIssuer_t orderIssuer, CBaseEntity* entity, bool queue, OrderQueueBehavior_t queueBehavior, bool showEffect);

class MemberInfo
{
public:
    cc name; //0x0000
    ui* unk4; //0x0008
    int Offset; //0x0010

};
MemberInfo* temps;



class ClassDescription
{
public:
    ui* self; //0x0000
    cc Name; //0x0008
    ui* void1; //0x0010
    uint32_t Unknown; //0x0018
    uint16_t MembersCount; //0x001C
    char pad_001E[10]; //0x001E
    MemberInfo* memberinfo; //0x0028

    ui GetOffset(cc offset) // m_bIsPhantom
    {

        for (int i = 0; i <= MembersCount; i++)
        {
            temps = (MemberInfo*)((ui)(this->memberinfo) + i * 0x20);
            cc thisname = temps->name;
            if (!thisname) { break; }
            if (!strcmp(offset, thisname))
            {
                return temps->Offset;
            }
            CMSG("%d ) Offset: %s  | %d\n ", i, temps->name, temps->Offset);


        }
        return 0;
    }
};

////////////////////////////////////////////////////
////////////// Prototypes //////////////////////////////
////////////////////////////////////////////////////







////////////////////////////////////////////////////
////////////// Global functions //////////////////////////////
////////////////////////////////////////////////////




int GetGameState()
{
    if (*(ui*)GetStatePointer)
    {
        return *(int*)(*(ui*)GetStatePointer + 0x58);
    }
    return 0;
}

